Tekla Open API Reference for Tekla Structures 2025
ReinforcementSingle.Attributes Property
 The attributes of the reinforcement. For more information see ReinforcementBase.ReinforcementSingleAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementBase.ReinforcementSingleAttributes Attributes { get; set; }
Public Property Attributes As ReinforcementBase.ReinforcementSingleAttributes
	Get
	Set
Property Value
Type: ReinforcementBase.ReinforcementSingleAttributes
See Also
Reference
ReinforcementSingle Class
Tekla.Structures.Drawing Namespace